### Data Manipulation on Loan DataSet

* About Data
    * Database resides in AWS 

* Connecting to Cloud AWS 
     * import create_engine
     * install pymssql
     * assign uri, engine and conn objects

* Verifying all existing tables from Database
     * SELECT TABLE_NAME FROM INFORMATION_SCHEMA.TABLES
        
* Load tables into pandas dataframe

* Joining two tables and store the result into dataframe
     * Solution1 - join tables using SQL join and store the result into dataframe
     * Solution2 - mergeing tables using df.merge() and store the result into dataframe
        
* Handling missing values
     * Identify missing values 
     * Droping those unwanted cols
     * Get only requuired cols and store the result into new df

* Answer Business Questions
     * Q1. How many customers took a loan?
     * Q2. How many customers have settled their loadn?
     * Q3. Loanamount by Tenor with Loanstatus is 'Due'?
     * Q4. Loanamount by LoanPurpose?
     * Q5. Average Loanamount requested by customer age(number)?

In [47]:
import pandas as pd
from sqlalchemy import create_engine

In [48]:
#install pymssql
!pip install pymssql

Requirement already satisfied: pymssql in c:\programdata\anaconda3\lib\site-packages (2.2.3)

WARNING: You are using pip version 20.2.4; however, version 21.3.1 is available.
You should consider upgrading via the 'c:\programdata\anaconda3\python.exe -m pip install --upgrade pip' command.

In [49]:
import pymssql

### Connecting to AWS Database

In [50]:
uri = "redacted"
engine = create_engine(uri)

In [51]:
conn = engine.connect()

In [ ]:
# Loans data, customer demographice

### Get all existing tables from Database

In [104]:
# All tables from the DataBase
pd.read_sql('SELECT TABLE_NAME FROM INFORMATION_SCHEMA.TABLES', conn)

        TABLE_NAME
0     LoanAccounts
1  TransactionsLog
2        Customers

### Load database tables into pandas dataframe

In [105]:
#Analysing LoanAccounts Data

In [106]:
query1 = 'SELECT * FROM [LOANAccounts]'

loans = pd.read_sql(query1, conn)

In [107]:
#Exporting to csv jus for my reference
loans.to_csv('loans.csv')

In [108]:
loans.head()

,Id,CreatedDate,CustomerId,LoanAmount,ProductId,LoanReason,Installment,Tenor,Rate,LoanStatus,FirstRepaymentDate,MaturityDate,TotalOutstandingPrincipal,TotalOutstandingInterest,TotalOutstandingBalance,IsEmployed,IsHomeOwner,RepaymentType,LoanPurpose
0,1,2021-06-08 21:54:53.830,2,40000.0,1,NA,54933.33,3,312.0,Rejected,2021-07-07,2021-08-09 21:54:53.820,40000.0,124800.00,164800.00,True,None,1,Business
1,2,2021-06-09 16:17:15.367,2,45000.0,1,NA,30900.00,6,312.0,Rejected,2021-07-08,2021-11-09 16:17:15.357,45000.0,140400.00,185400.00,True,None,1,SpecialEvents
2,3,2021-06-09 18:01:55.690,2,45000.0,1,NA,30900.00,6,312.0,Rejected,2021-07-08,2021-11-09 18:01:55.690,45000.0,140400.00,185400.00,True,None,1,Investment
3,4,2021-06-09 18:16:59.903,2,25000.0,1,NA,34333.33,3,312.0,Rejected,2021-07-08,2021-08-09 18:16:59.900,25000.0,78000.00,103000.00,True,None,1,Investment
4,5,2021-06-09 18:49:50.483,2,25000.0,1,NA,10774.98,4,312.0,Settled,2021-07-08,2021-09-09 18:49:50.483,25000.0,18099.93,43099.93,True,None,1,Rent

In [57]:
#Check whether all columns are having right datatypes
loans.dtypes

Id                                    int64
CreatedDate                  datetime64[ns]
CustomerId                            int64
LoanAmount                          float64
ProductId                             int64
LoanReason                           object
Installment                         float64
Tenor                                 int64
Rate                                float64
LoanStatus                           object
FirstRepaymentDate           datetime64[ns]
MaturityDate                 datetime64[ns]
TotalOutstandingPrincipal           float64
TotalOutstandingInterest            float64
TotalOutstandingBalance             float64
IsEmployed                             bool
IsHomeOwner                          object
RepaymentType                         int64
LoanPurpose                          object
dtype: object

In [109]:
query2 = 'SELECT * FROM Customers'

customers = pd.read_sql(query2, conn)

In [110]:
#Exporting to csv jus for my reference
customers.to_csv('customers.csv')

In [111]:
loans['LoanReason'].unique()

array(['NA'], dtype=object)

In [112]:
customers.head(2)

,Id,DateOfBirth,Gender,MaritalStatus,CreditScore,LastLoginTime,IsEmailConfirmed,EmailConfirmationDate,PhoneNumberConfirmationDate,IsPhoneNumberConfirmed,EmployerSector,EmploymentStatus,IsVerified,IsBasicProfileComplete
0,1,1997-06-20 00:00:00,Female,Single,0,None,True,2021-06-08 20:04:32.227,None,False,Private,Employed,None,True
1,2,1983-03-25 00:00:00,Male,Married,0,None,True,2021-06-08 20:50:22.583,None,False,Private,Employed,None,True

In [113]:
customers.dtypes

Id                                      int64
DateOfBirth                            object
Gender                                 object
MaritalStatus                          object
CreditScore                            object
LastLoginTime                          object
IsEmailConfirmed                         bool
EmailConfirmationDate          datetime64[ns]
PhoneNumberConfirmationDate            object
IsPhoneNumberConfirmed                   bool
EmployerSector                         object
EmploymentStatus                       object
IsVerified                             object
IsBasicProfileComplete                   bool
dtype: object

### Joining two tables and store the result into dataframe

In [114]:
#Solution1 - Merging the Customer table with the LoanAccount table using SQL
query3 = 'SELECT L.*,C.* from LoanAccounts L join Customers C on L.CustomerId = C.Id'
CustomerLoanAccounts = pd.read_sql(query3, conn)

In [64]:
CustomerLoanAccounts.head(2)

,Id,CreatedDate,CustomerId,LoanAmount,ProductId,LoanReason,Installment,Tenor,Rate,LoanStatus,...,CreditScore,LastLoginTime,IsEmailConfirmed,EmailConfirmationDate,PhoneNumberConfirmationDate,IsPhoneNumberConfirmed,EmployerSector,EmploymentStatus,IsVerified,IsBasicProfileComplete
0,6,2021-06-09 18:51:18.263,1,25000.0,1,NA,9459.86,6,360.0,Settled,...,0,None,True,2021-06-08 20:04:32.227,None,False,Private,Employed,None,True
1,15,2021-06-11 09:34:33.620,1,25000.0,1,NA,9459.86,6,360.0,Settled,...,0,None,True,2021-06-08 20:04:32.227,None,False,Private,Employed,None,True

In [115]:
#Solution2
# Merging the Customer table/customers dataframe  with the LoanAccount table/loans dataframe using Pandas, 
# Using left_on and right_on because both tables have different col_names for primary and forignkey
customer_loans_account = loans.merge(customers, left_on = 'CustomerId', right_on='Id')

In [116]:
customer_loans_account.shape

(6081, 33)

In [117]:
customer_loans_account.head(2)

,Id_x,CreatedDate,CustomerId,LoanAmount,ProductId,LoanReason,Installment,Tenor,Rate,LoanStatus,...,CreditScore,LastLoginTime,IsEmailConfirmed,EmailConfirmationDate,PhoneNumberConfirmationDate,IsPhoneNumberConfirmed,EmployerSector,EmploymentStatus,IsVerified,IsBasicProfileComplete
0,1,2021-06-08 21:54:53.830,2,40000.0,1,NA,54933.33,3,312.0,Rejected,...,0,None,True,2021-06-08 20:50:22.583,None,False,Private,Employed,None,True
1,2,2021-06-09 16:17:15.367,2,45000.0,1,NA,30900.00,6,312.0,Rejected,...,0,None,True,2021-06-08 20:50:22.583,None,False,Private,Employed,None,True

### Handling Missing Values

In [118]:
#Find Missing values sum
customer_loans_account.isnull().sum()

Id_x                              0
CreatedDate                       0
CustomerId                        0
LoanAmount                        0
ProductId                         0
LoanReason                        0
Installment                       0
Tenor                             0
Rate                              0
LoanStatus                        0
FirstRepaymentDate                0
MaturityDate                      0
TotalOutstandingPrincipal         0
TotalOutstandingInterest          0
TotalOutstandingBalance           0
IsEmployed                        0
IsHomeOwner                    6081
RepaymentType                     0
LoanPurpose                       0
Id_y                              0
DateOfBirth                       0
Gender                            0
MaritalStatus                     0
CreditScore                       0
LastLoginTime                  6081
IsEmailConfirmed                  0
EmailConfirmationDate             0
PhoneNumberConfirmationDate    6081
IsPhoneNumberConfirmed            0
EmployerSector                    0
EmploymentStatus                  0
IsVerified                     6081
IsBasicProfileComplete            0
dtype: int64

### Dropping unwanted cols

In [119]:
CustomerLoanAccounts.drop(['IsHomeOwner','LastLoginTime','PhoneNumberConfirmationDate','IsVerified'], axis=1, inplace=True)

In [121]:
CustomerLoanAccounts.head(2)

,Id,CreatedDate,CustomerId,LoanAmount,ProductId,LoanReason,Installment,Tenor,Rate,LoanStatus,...,DateOfBirth,Gender,MaritalStatus,CreditScore,IsEmailConfirmed,EmailConfirmationDate,IsPhoneNumberConfirmed,EmployerSector,EmploymentStatus,IsBasicProfileComplete
0,6,2021-06-09 18:51:18.263,1,25000.0,1,NA,9459.86,6,360.0,Settled,...,1997-06-20,Female,Single,0,True,2021-06-08 20:04:32.227,False,Private,Employed,True
1,15,2021-06-11 09:34:33.620,1,25000.0,1,NA,9459.86,6,360.0,Settled,...,1997-06-20,Female,Single,0,True,2021-06-08 20:04:32.227,False,Private,Employed,True

In [122]:
CustomerLoanAccounts.shape

(6081, 29)

In [123]:
CustomerLoanAccounts.columns

Index(['Id', 'CreatedDate', 'CustomerId', 'LoanAmount', 'ProductId',
       'LoanReason', 'Installment', 'Tenor', 'Rate', 'LoanStatus',
       'FirstRepaymentDate', 'MaturityDate', 'TotalOutstandingPrincipal',
       'TotalOutstandingInterest', 'TotalOutstandingBalance', 'IsEmployed',
       'RepaymentType', 'LoanPurpose', 'Id', 'DateOfBirth', 'Gender',
       'MaritalStatus', 'CreditScore', 'IsEmailConfirmed',
       'EmailConfirmationDate', 'IsPhoneNumberConfirmed', 'EmployerSector',
       'EmploymentStatus', 'IsBasicProfileComplete'],
      dtype='object')

### Getting only required columns and store the result into new df

In [124]:
#Getting only required cols
cleaned_customerLoanAccounts = CustomerLoanAccounts[['CreatedDate','CustomerId', 'LoanAmount','Tenor','LoanStatus', 'TotalOutstandingInterest','TotalOutstandingBalance','LoanPurpose','Gender','DateOfBirth','MaritalStatus']]

In [125]:
cleaned_customerLoanAccounts.head()

,CreatedDate,CustomerId,LoanAmount,Tenor,LoanStatus,TotalOutstandingInterest,TotalOutstandingBalance,LoanPurpose,Gender,DateOfBirth,MaritalStatus
0,2021-06-09 18:51:18.263,1,25000.0,6,Settled,31759.14,56759.14,Business,Female,1997-06-20,Single
1,2021-06-11 09:34:33.620,1,25000.0,6,Settled,31759.14,56759.14,Business,Female,1997-06-20,Single
2,2021-06-30 07:23:26.380,1,35000.0,5,Rejected,36851.77,71851.77,Education,Female,1997-06-20,Single
3,2021-07-10 21:46:19.800,1,25000.0,6,Rejected,31759.14,56759.14,Education,Female,1997-06-20,Single
4,2021-09-10 19:42:06.437,1,25000.0,6,Rejected,31759.16,56759.16,Investment,Female,1997-06-20,Single

### Answering Business Questions

In [126]:
df = cleaned_customerLoanAccounts

### Q1. How many customers took a loan?

In [127]:
#How many customers took a loan ? 
df['CustomerId'].nunique()

3716

### Q2. How many customers have settled their loadn?

In [128]:
# How many customers have settled their loan ? - None
df.LoanStatus.unique()

array(['Settled', 'Rejected', 'Due', 'Active'], dtype=object)

In [129]:
# How many customers have settled their loan ? - None
df[df.LoanStatus == 'Settled'].CustomerId.nunique()

516

In [130]:
df.head(2)

,CreatedDate,CustomerId,LoanAmount,Tenor,LoanStatus,TotalOutstandingInterest,TotalOutstandingBalance,LoanPurpose,Gender,DateOfBirth,MaritalStatus
0,2021-06-09 18:51:18.263,1,25000.0,6,Settled,31759.14,56759.14,Business,Female,1997-06-20,Single
1,2021-06-11 09:34:33.620,1,25000.0,6,Settled,31759.14,56759.14,Business,Female,1997-06-20,Single

### Q3. Loanamount by Tenor with Loanstatus is 'Due'?

In [131]:
df.LoanStatus.unique()

array(['Settled', 'Rejected', 'Due', 'Active'], dtype=object)

In [132]:
# LoanAmount with Loanstatus=Due by Tenor 
df[df.LoanStatus == 'Due'].groupby('Tenor')['TotalOutstandingBalance'].sum()

Tenor
3    4.833339e+07
4    1.809070e+07
5    1.230564e+07
6    1.737599e+08
Name: TotalOutstandingBalance, dtype: float64

### Q4. Loanamount by LoanPurpose?

In [133]:
#Average Loan Amount requested by Customer Age (Number)
df.head(2)

,CreatedDate,CustomerId,LoanAmount,Tenor,LoanStatus,TotalOutstandingInterest,TotalOutstandingBalance,LoanPurpose,Gender,DateOfBirth,MaritalStatus
0,2021-06-09 18:51:18.263,1,25000.0,6,Settled,31759.14,56759.14,Business,Female,1997-06-20,Single
1,2021-06-11 09:34:33.620,1,25000.0,6,Settled,31759.14,56759.14,Business,Female,1997-06-20,Single

In [134]:
# Loan Amount by Purpose
df.groupby('LoanPurpose').LoanAmount.sum()

LoanPurpose
Bills                 18026000.0
Business             286201300.0
CarExpense             8241000.0
DebtConsideration      3273000.0
Education             20761000.0
Emergency             59735000.0
Entertainment          1325000.0
Food_Provisions        6745000.0
Investment            32185000.0
MedicalBills          27031000.0
PocketMoney            1310000.0
Rent                  40566009.0
SpecialEvents          4435000.0
Name: LoanAmount, dtype: float64

### Q5. Average Loanamount requested by customer age(number)?

In [135]:
df.head(2)

,CreatedDate,CustomerId,LoanAmount,Tenor,LoanStatus,TotalOutstandingInterest,TotalOutstandingBalance,LoanPurpose,Gender,DateOfBirth,MaritalStatus
0,2021-06-09 18:51:18.263,1,25000.0,6,Settled,31759.14,56759.14,Business,Female,1997-06-20,Single
1,2021-06-11 09:34:33.620,1,25000.0,6,Settled,31759.14,56759.14,Business,Female,1997-06-20,Single

In [136]:
# To safely disable SettingWithCopywarning with the following assignment.
pd.options.mode.chained_assignment = None  # default='warn'

In [137]:

#Solution 1
now = pd.Timestamp('now')
df['age'] = (now - df['DateOfBirth']).astype('<m8[Y]')

In [138]:
df.head()

,CreatedDate,CustomerId,LoanAmount,Tenor,LoanStatus,TotalOutstandingInterest,TotalOutstandingBalance,LoanPurpose,Gender,DateOfBirth,MaritalStatus,age
0,2021-06-09 18:51:18.263,1,25000.0,6,Settled,31759.14,56759.14,Business,Female,1997-06-20,Single,24.0
1,2021-06-11 09:34:33.620,1,25000.0,6,Settled,31759.14,56759.14,Business,Female,1997-06-20,Single,24.0
2,2021-06-30 07:23:26.380,1,35000.0,5,Rejected,36851.77,71851.77,Education,Female,1997-06-20,Single,24.0
3,2021-07-10 21:46:19.800,1,25000.0,6,Rejected,31759.14,56759.14,Education,Female,1997-06-20,Single,24.0
4,2021-09-10 19:42:06.437,1,25000.0,6,Rejected,31759.16,56759.16,Investment,Female,1997-06-20,Single,24.0

In [139]:
df.groupby('age').LoanAmount.sum()

age
18.0     2725000.0
19.0      770000.0
20.0     4200000.0
21.0     6295000.0
22.0     9324000.0
23.0     7216000.0
24.0    12376000.0
25.0    14376000.0
26.0    17120000.0
27.0    19451500.0
28.0    24145009.0
29.0    25685500.0
30.0    20910000.0
31.0    28970000.0
32.0    28525500.0
33.0    25315000.0
34.0    25733800.0
35.0    24125000.0
36.0    26711000.0
37.0    20461000.0
38.0    23406000.0
39.0    16969000.0
40.0    15519000.0
41.0    13750000.0
42.0    13020000.0
43.0    12944000.0
44.0    11965000.0
45.0     6637000.0
46.0    11010000.0
47.0     4680000.0
48.0     4600000.0
49.0     4305000.0
50.0     1857000.0
51.0     3880000.0
52.0     1760000.0
53.0     3163000.0
54.0     2390000.0
55.0      912000.0
56.0     3720000.0
57.0     1845000.0
58.0     1551000.0
59.0      390000.0
60.0      965000.0
61.0     1830000.0
62.0      496000.0
63.0      640000.0
65.0     1150000.0
71.0       45000.0
Name: LoanAmount, dtype: float64

In [140]:
# Solution 2
df['Age'] = 2022 - df['DateOfBirth'].dt.year
df.groupby('Age')['LoanAmount'].mean()

Age
19     86515.151515
20     42666.666667
21     76696.428571
22     54912.280702
23     70640.287770
24     46583.333333
25     56898.148148
26     58859.922179
27     67900.826446
28     76869.140625
29     82587.444056
30     71254.716981
31     80278.810409
32     85665.634675
33    101403.010033
34     86297.101449
35     96617.228464
36     85750.853242
37     81092.024540
38     87144.104803
39     90279.527559
40     87170.984456
41     91825.581395
42     95941.558442
43     95000.000000
44    110688.524590
45    121413.043478
46     87964.705882
47    111098.901099
48     79237.288136
49    108452.380952
50    121081.081081
51     93444.444444
52    117575.757576
53     92631.578947
54    103121.212121
55     93478.260870
56    118357.142857
57    157894.736842
58    108611.111111
59    100400.000000
60     60000.000000
61    160833.333333
62    123750.000000
63    115333.333333
64    128000.000000
65     35000.000000
66    223000.000000
72     45000.000000
Name: LoanAmount, dtype: float64

In [ ]:
Total Loan amount disbursed by DisbursedMonth, Gender, Tenor.
Average days to disburse loan from application date ( Loan creation date, Loan Disbursement Date)
Average Loan amount disbursed to Female for Business Purpose
Average Age of Customers requesting loan for Educational Purpose
Customers with the max credit score, average tenor for the loan disbursed to them.

In [ ]:
# Total Loan amount disbursed by DisbursedMonth, Gender, Tenor

In [141]:
df.head(2)

,CreatedDate,CustomerId,LoanAmount,Tenor,LoanStatus,TotalOutstandingInterest,TotalOutstandingBalance,LoanPurpose,Gender,DateOfBirth,MaritalStatus,age,Age
0,2021-06-09 18:51:18.263,1,25000.0,6,Settled,31759.14,56759.14,Business,Female,1997-06-20,Single,24.0,25
1,2021-06-11 09:34:33.620,1,25000.0,6,Settled,31759.14,56759.14,Business,Female,1997-06-20,Single,24.0,25

In [ ]:
df.groupby('LoanAmount')['']

In [96]:
#Get the TransactionLog data from database and store it in dataframe
query3 = 'SELECT * FROM [TransactionsLog]'

transactions = pd.read_sql(query3, conn)

In [97]:
transactions.head(2)

,Id,CreatedDate,Amount,PaymentType,LoanAccountId,RepaymentDate,RepaymentDeduction
0,1,2021-06-09 18:51:36.960,25000.0,LoanDisbursement,5,2021-06-09 18:51:36.960,
1,2,2021-06-09 19:03:07.937,45000.0,LoanDisbursement,7,2021-06-09 19:03:07.937,

In [102]:
transactions.PaymentType.value_counts()

CPA                        5919
BankTransfer               5077
LoanDisbursement           2798
CardPayment                2566
Liquidation                1357
Withdrawal_Cancellation     315
CashDeposit                  15
GoodwillCredit                5
Name: PaymentType, dtype: int64

In [143]:
CustomerLoanAccounts.head()

,Id,CreatedDate,CustomerId,LoanAmount,ProductId,LoanReason,Installment,Tenor,Rate,LoanStatus,...,DateOfBirth,Gender,MaritalStatus,CreditScore,IsEmailConfirmed,EmailConfirmationDate,IsPhoneNumberConfirmed,EmployerSector,EmploymentStatus,IsBasicProfileComplete
0,6,2021-06-09 18:51:18.263,1,25000.0,1,NA,9459.86,6,360.0,Settled,...,1997-06-20,Female,Single,0,True,2021-06-08 20:04:32.227,False,Private,Employed,True
1,15,2021-06-11 09:34:33.620,1,25000.0,1,NA,9459.86,6,360.0,Settled,...,1997-06-20,Female,Single,0,True,2021-06-08 20:04:32.227,False,Private,Employed,True
2,227,2021-06-30 07:23:26.380,1,35000.0,1,NA,14370.35,5,360.0,Rejected,...,1997-06-20,Female,Single,0,True,2021-06-08 20:04:32.227,False,Private,Employed,True
3,1207,2021-07-10 21:46:19.800,1,25000.0,1,NA,9459.86,6,360.0,Rejected,...,1997-06-20,Female,Single,0,True,2021-06-08 20:04:32.227,False,Private,Employed,True
4,5509,2021-09-10 19:42:06.437,1,25000.0,1,NA,9459.86,6,360.0,Rejected,...,1997-06-20,Female,Single,0,True,2021-06-08 20:04:32.227,False,Private,Employed,True

In [142]:
customer_loan_transactions = CustomerLoanAccounts.merge(transactions, on='Id')

ValueError: The column label 'Id' is not unique.